Repository: xcv58/MacTools
Catalog: Plugins/CloudflareR2/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# status.preparing
source: 准备上传 %@…
ar: جارٍ تحضير %@ للرفع…
de: Upload von %@ wird vorbereitet…
en: Preparing to upload %@…
es: Preparando %@ para subirlo…
fr: Préparation de l’envoi de %@…
ja: %@ のアップロードを準備中…
ko: %@ 업로드 준비 중…
pt: Preparando o upload de %@…
ru: Подготовка к загрузке %@…
tr: %@ karşıya yüklenmeye hazırlanıyor…
zh_hant: 正在準備上傳 %@…

# status.succeeded
source: 上传完成：%@
ar: اكتمل الرفع: %@
de: Upload abgeschlossen: %@
en: Upload complete: %@
es: Subida completada: %@
fr: Envoi terminé : %@
ja: アップロード完了：%@
ko: 업로드 완료: %@
pt: Upload concluído: %@
ru: Загрузка завершена: %@
tr: Karşıya yükleme tamamlandı: %@
zh_hant: 上傳完成：%@

# status.uploading
source: 正在上传 %@… %d%%
ar: جارٍ رفع %@… %d%%
de: %@ wird hochgeladen… %d%%
en: Uploading %@… %d%%
es: Subiendo %@… %d%%
fr: Envoi de %@… %d%%
ja: %@ をアップロード中… %d%%
ko: %@ 업로드 중… %d%%
pt: Enviando %@… %d%%
ru: Загрузка %@… %d%%
tr: %@ karşıya yükleniyor… %d%%
zh_hant: 正在上傳 %@… %d%%

# upload.conflict.detail
source: 覆盖上传会替换 R2 中的现有对象。
ar: سيؤدي الاستبدال إلى استبدال الكائن الموجود في R2.
de: Beim Überschreiben wird das vorhandene Objekt in R2 ersetzt.
en: Overwriting will replace the existing object in R2.
es: Al sobrescribir se reemplazará el objeto existente en R2.
fr: L’écrasement remplacera l’objet existant dans R2.
ja: 上書きすると、R2 内の既存オブジェクトが置き換えられます。
ko: 덮어쓰면 R2의 기존 객체가 대체됩니다.
pt: A substituição trocará o objeto existente no R2.
ru: При перезаписи существующий объект в R2 будет заменен.
tr: Üzerine yazma, R2'deki mevcut nesneyi değiştirir.
zh_hant: 覆寫上傳會取代 R2 中的現有物件。

# upload.conflict.overwrite
source: 覆盖上传
ar: استبدال ورفع
de: Überschreiben
en: Overwrite
es: Sobrescribir
fr: Écraser
ja: 上書き
ko: 덮어쓰기
pt: Sobrescrever
ru: Перезаписать
tr: Üzerine Yaz
zh_hant: 覆寫上傳

# upload.conflict.rename
source: 重新命名
ar: إعادة تسمية
de: Umbenennen
en: Rename
es: Cambiar nombre
fr: Renommer
ja: 名前を変更
ko: 이름 변경
pt: Renomear
ru: Переименовать
tr: Yeniden Adlandır

# upload.conflict.title
source: “%@” 已存在
ar: ‏«%@» موجود بالفعل
de: „%@“ ist bereits vorhanden
en: “%@” Already Exists
es: «%@» ya existe
fr: « %@ » existe déjà
ja: 「%@」はすでに存在します
ko: ‘%@’이(가) 이미 존재합니다
pt: “%@” já existe
ru: «%@» уже существует
tr: “%@” Zaten Var

# upload.naming.fileName
source: 文件名
ar: اسم الملف
de: Dateiname
en: File Name
es: Nombre de archivo
fr: Nom du fichier
ja: ファイル名
ko: 파일 이름
pt: Nome do arquivo
ru: Имя файла
tr: Dosya Adı
zh_hant: 檔案名稱

# upload.naming.placeholder
source: 输入上传后的文件名
ar: أدخل اسم الملف بعد رفعه
de: Dateinamen für den Upload eingeben
en: Enter the uploaded file name
es: Introduce el nombre del archivo subido
fr: Saisissez le nom du fichier envoyé
ja: アップロード後のファイル名を入力
ko: 업로드할 파일 이름 입력
pt: Insira o nome do arquivo após o upload
ru: Введите имя файла после загрузки
tr: Karşıya yüklenecek dosya adını girin
zh_hant: 輸入上傳後的檔案名稱

# upload.naming.random.accessibility
source: 生成随机文件名
ar: إنشاء اسم ملف عشوائي
de: Zufälligen Dateinamen erzeugen
en: Generate a random file name
es: Generar un nombre de archivo aleatorio
fr: Générer un nom de fichier aléatoire
ja: ランダムなファイル名を生成
ko: 무작위 파일 이름 생성
pt: Gerar um nome de arquivo aleatório
ru: Создать случайное имя файла
tr: Rastgele dosya adı oluştur
zh_hant: 產生隨機檔案名稱

# upload.naming.random.help
source: 生成随机 UUID 文件名（保留扩展名）
ar: إنشاء اسم ملف UUID عشوائي مع الاحتفاظ بالامتداد
de: Zufälligen UUID-Dateinamen erzeugen und Erweiterung beibehalten
en: Generate a random UUID file name while preserving the extension
es: Genera un nombre de archivo UUID aleatorio y conserva la extensión
fr: Générez un nom de fichier UUID aléatoire en conservant l’extension
ja: 拡張子を保持したランダムな UUID ファイル名を生成
ko: 확장자를 유지하면서 무작위 UUID 파일 이름 생성
pt: Gere um nome de arquivo UUID aleatório preservando a extensão
ru: Создать случайное имя UUID, сохранив расширение
tr: Uzantıyı koruyarak rastgele bir UUID dosya adı oluşturur
zh_hant: 產生隨機 UUID 檔案名稱（保留副檔名）

# upload.naming.start
source: 开始上传
ar: بدء الرفع
de: Upload starten
en: Start Upload
es: Iniciar subida
fr: Commencer l’envoi
ja: アップロードを開始
ko: 업로드 시작
pt: Iniciar upload
ru: Начать загрузку
tr: Karşıya Yüklemeyi Başlat
zh_hant: 開始上傳

# upload.naming.validation
source: 请输入不包含 / 的有效文件名。
ar: أدخل اسم ملف صالحاً لا يحتوي على /.
de: Geben Sie einen gültigen Dateinamen ohne / ein.
en: Enter a valid file name that does not contain /.
es: Introduce un nombre de archivo válido que no contenga /.
fr: Saisissez un nom de fichier valide ne contenant pas /.
ja: / を含まない有効なファイル名を入力してください。
ko: /를 포함하지 않는 유효한 파일 이름을 입력하십시오.
pt: Insira um nome de arquivo válido que não contenha /.
ru: Введите допустимое имя файла без /.
tr: / içermeyen geçerli bir dosya adı girin.
zh_hant: 請輸入不包含 / 的有效檔案名稱。

# validation.objectPrefix
source: 对象前缀不能包含名为“.”或“..”的路径段。
ar: لا يمكن أن تحتوي بادئة الكائن على مقطع مسار باسم «.» أو «..».
de: Das Objektpräfix darf keine Pfadsegmente namens „.“ oder „..“ enthalten.
en: The object prefix cannot contain path segments named "." or "..".
es: El prefijo de objeto no puede contener segmentos de ruta llamados «.» ni «..».
fr: Le préfixe d’objet ne peut pas contenir de segments de chemin nommés « . » ou « .. ».
ja: オブジェクトプレフィックスに「.」または「..」というパス要素は使用できません。
ko: 객체 접두사에는 '.' 또는 '..' 경로 세그먼트를 포함할 수 없습니다.
pt: O prefixo do objeto não pode conter segmentos de caminho chamados "." nem "..".
ru: Префикс объекта не может содержать сегменты пути «.» или «..».
tr: Nesne öneki "." veya ".." adlı yol bölümleri içeremez.
zh_hant: 物件前綴不可包含名為「.」或「..」的路徑區段。

# validation.publicURL
source: 请输入以 http:// 或 https:// 开头的有效地址。
ar: أدخل عنواناً صالحاً يبدأ بـ http:// أو https://.
de: Geben Sie eine gültige Adresse ein, die mit http:// oder https:// beginnt.
en: Enter a valid address beginning with http:// or https://.
es: Introduce una dirección válida que empiece por http:// o https://.
fr: Saisissez une adresse valide commençant par http:// ou https://.
ja: http:// または https:// で始まる有効なアドレスを入力してください。
ko: http:// 또는 https://로 시작하는 유효한 주소를 입력하십시오.
pt: Insira um endereço válido que comece com http:// ou https://.
ru: Введите допустимый адрес, начинающийся с http:// или https://.
tr: http:// veya https:// ile başlayan geçerli bir adres girin.
zh_hant: 請輸入以 http:// 或 https:// 開頭的有效網址。
